Revit 2027 API
PropertyLine.SetBoundary Method
 Set a given curve loops as the boundary of the current PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBoundary(
	IList<CurveLoop> curveLoops
)
Public Sub SetBoundary (
	curveLoops As IList(Of CurveLoop)
)
public:
void SetBoundary(
	IList<CurveLoop^>^ curveLoops
)
member SetBoundary :
        curveLoops : IList<CurveLoop> -> unit
Parameters
curveLoops IList<CurveLoop>
 A collection of curve loops to be added.
Exceptions
Exception | Condition
ArgumentException |  The input curve loops cannot compose a valid boundary, that means: no curve loop is contained in the given collection; these curve loops intersect with each other for some of them; or each curve loop is not planar; or each curve loop is not in a plane parallel to the horizontal(XY) plane.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create the Sketch for the boundary of current PropertyLine element.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace